[
  {
    "image": "https://i.ibb.co.com/qPt40yT/c5f70ea42e514eb827d3080c46ceac3a.jpg",
    "title": "PhotoMaster Lite",
    "companyName": "PixelSoft",
    "id": 1,
    "description": "PhotoMaster Lite is your go-to lightweight photo editing app that brings professional-level tools into a compact and fast experience. Designed for both beginners and hobbyists, this app offers an intuitive interface that lets you transform your photos in seconds. With essential filters, brightness and contrast controls, cropping tools, and background blur options, you can easily enhance your images without requiring heavy software. PhotoMaster Lite also supports real-time previews, so you can instantly see how your changes will look before saving. One of the standout features is its smart AI enhancement mode, which automatically adjusts lighting and color balance to give your photos a polished and natural finish. The app is optimized to run smoothly even on low-end devices, making it perfect for quick edits on the go. It includes a variety of preset filters for portraits, landscapes, and artistic effects that can turn an ordinary image into something extraordinary. You can also remove blemishes, whiten teeth, and smooth skin effortlessly using the retouch tool. PhotoMaster Lite supports offline editing, so you can enhance your pictures anytime, anywhere without internet access. Whether you’re editing selfies, travel shots, or professional photos, PhotoMaster Lite ensures top quality output without consuming too much storage space. With regular updates and new filter packs, you’ll always find fresh creative tools to experiment with. Share your edited masterpieces directly to Instagram, Facebook, or any platform right from the app. Fast, smooth, and easy to use, PhotoMaster Lite is a must-have for anyone who loves photography but values speed, simplicity, and stunning results. Experience the joy of creative editing without the complexity!",
    "size": 20,
    "reviews": 1200,
    "ratingAvg": 4.5,
    "downloads": "1.5M",
    "mb": "220 MB",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 570 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Fq5TBLZP/e296de5140bb293a347de8a5c20270c4.jpg",
    "title": "Mini Racer",
    "companyName": "SpeedyGames",
    "id": 2,
    "description": "Fun  an action-packed mobile racing game that delivers pure adrenaline and excitement in a small package. Designed for gamers of all ages, it combines simple controls with challenging tracks and high-speed competition. Whether you’re a casual player or a racing enthusiast, Mini Racer keeps you engaged with smooth gameplay and dynamic challenges. The game features multiple race modes, including time.",
    "size": 18,
    "reviews": 2000,
    "ratingAvg": 4.2,
    "downloads": "2.1M",
    "mb": "410 MB",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 750 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/pBsRMxX2/bcf812f6a4fb96feededb181ea0ff066.jpg",
    "title": "NoteSync",
    "companyName": "NovaWare",
    "id": 3,
    "description": "SyncNoteSync is a smart and intuitive note-taking app designed to help you organize your thoughts, tasks, and projects effortlessly. Whether you’re a student, professional, or creative thinker, NoteSync keeps your notes safe, synchronized, and accessible across all your devices. With its clean and minimal interface, you can focus on what matters most — your ideas. The app allows you to create text notes, checklists, voice memos, and even image-based notes. Its real-time synchronization ensures your data is instantly updated on every device you use, preventing any loss of information. NoteSync’s powerful tagging and search system lets you find what you need instantly, even among hundreds of notes. You can create folders, color-code your notes, and set reminders for deadlines or important events. The offline mode ensures you can write and access notes anytime, and the cloud backup feature gives you peace of mind. It also includes collaborative options — share notes with colleagues or classmates and work together in real time. Security is a top priority, with password and biometric protection available to keep your private thoughts safe. NoteSync’s performance is optimized for speed, ensuring quick load times even with large data. With seamless integration across mobile .",
    "size": 22,
    "reviews": 900,
    "ratingAvg": 4.7,
    "downloads": "2.8M",
    "mb": "211 MB",
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 200 },
      { "name": "5 star", "count": 585 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/9mzrv8PC/41a028533f077b7eaca4c15ad0287d04.jpg",
    "title": "Puzzle Blocks",
    "companyName": "BrainyGames",
    "id": 4,
    "description": "Puzzle Blocks is a vibrant and addictive block-matching puzzle game designed to challenge your brain while keeping you entertained for hours. The gameplay is simple yet deeply engaging — drag and fit colorful block shapes onto the board to fill the empty spaces. Sounds easy? Think again! As you progress, the puzzles get more complex, testing your logic and problem-solving skills. With hundreds of handcrafted levels, Puzzle Blocks ensures you never run out of fun.",
    "size": 21,
    "reviews": 1300,
    "ratingAvg": 4.4,
    "downloads": "1.9M",
    "mb": "214 MB",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 620 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tw3vMqS0/8557a65b554783a45dd2d8d24040dcf2.jpg",
    "title": "CalmSpace",
    "companyName": "MindEase",
    "id": 5,
    "description": "CalmSpace is your personal relaxation and mindfulness companion designed to help you unwind, sleep better, and find peace in your busy day. The app combines calming sounds, guided meditations, and sleep music to create the perfect environment for stress relief. Whether you’re struggling with anxiety, insomnia, or just need a break from the chaos of life, CalmSpace provides the tools to restore balance. Choose from a wide range of soothing audio",
    "size": 19,
    "reviews": 1700,
    "ratingAvg": 4.8,
    "downloads": "1.4M",
    "mb": "364 MB",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 1240 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZQ8K45q/02556664c8b2689ab5526a56c93565eb.jpg",
    "title": "Space Shooter",
    "companyName": "StarGames",
    "id": 6,
    "description": "Space Shooter takes you on an epic galactic adventure where you must defend the universe against waves of alien invaders. With smooth gameplay, stunning graphics, and easy controls,",
    "size": 23,
    "reviews": 1600,
    "ratingAvg": 4.3,
    "downloads": "1.1M",
    "mb": "102 MB",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 820 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/G3W32Q85/ff9de1aa14117f0e4ac3196f655c745e.jpg",
    "title": "WeatherNow",
    "companyName": "SkySoft",
    "id": 7,
    "description": "WeatherNow is your reliable companion for accurate, real-time weather forecasts anytime, anywhere. Designed with simplicity and precision in mind, the app delivers up-to-date information including temperature, humidity, wind speed, air quality, and UV index. Whether you’re planning a trip, scheduling outdoor activities, or just curious about the day’s forecast, WeatherNow ensures you’re always prepared. The app uses advanced meteorological data sources for hyper-local accuracy and provides hourly as well as 7-day forecasts. With its elegant, easy-to-read interface, users can quickly check detailed weather conditions at a glance. You can customize themes, switch between Celsius and Fahrenheit, and receive real-time alerts for storms or severe conditions. The animated weather backgrounds change with the forecast, creating a visually engaging experience. WeatherNow also includes sunrise and sunset times, moon phases, and radar maps to help you plan more effectively. The widget support lets you keep weather updates right on your home screen. Optimized for speed and efficiency, the app loads instantly and consumes minimal battery. Whether you’re in a bustling city or a remote village, WeatherNow gives you the data you need. It’s lightweight, stylish, and reliable — the perfect tool for everyday life. Stay ahead of the weather with WeatherNow and make smarter decisions wherever you go.",
    "size": 20,
    "reviews": 1000,
    "ratingAvg": 4.6,
    "downloads": "3.95M",
    "mb": "110 MB",
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 555 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nsTDcFmP/a0ac0538fadf9296abd23c9c5f50f26d.jpg",
    "title": "Word Quest",
    "companyName": "PuzzleFun",
    "id": 8,
    "description": "Word Quest is a fun and addictive word puzzle game designed to test your vocabulary and sharpen your mind. Whether you’re a word enthusiast or just looking for a relaxing game, Word Quest offers endless entertainment. The gameplay is simple — swipe letters to form words and solve puzzles. But as you progress, the levels become more challenging, pushing your creativity and memory. With thousands of unique puzzles across various difficulty levels, there’s always something new to discover. The game’s colorful interface and smooth animations make it enjoyable for players of al",
    "size": 19,
    "reviews": 1400,
    "ratingAvg": 4.5,
    "downloads": "2.87M",
    "mb": "217 MB",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 785 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HfGbjLdd/74fdb288e0353992f5ae28837b790649.jpg",
    "title": "BudgetBuddy",
    "companyName": "FinancePro",
    "id": 9,
    "description": "BudgetBuddy is the ultimate financial management app designed to help you take control of your money effortlessly. Whether you’re tracking daily expenses, setting monthly budgets, or saving for long-term goals, BudgetBuddy makes managing finances simple and stress-free. The app offers a clean and intuitive dashboard that shows all your income and expenses in one place. You can categorize spending, set spending limits, and view visual charts that make understanding your financial habits easier. BudgetBuddy also includes automatic expense tracking, allowing you to link your bank accounts or manually add transactions. Set reminders for upcoming bills and never miss a payment again. The app’s smart analytics give you insights into where your money goes and how to save more effectively. You can export your financial reports for personal or business use. Data security is a top priority — all information is encrypted and stored safely. Whether you’re budgeting alone or sharing with a partner, you can manage multiple accounts effortlessly. Offline mode allows you to track expenses anytime, even without internet access. Lightweight yet powerful, BudgetBuddy is perfect for beginners and experts alike. With customizable categories, savings goals, and daily notifications, it ensures you stay on track financially. Take the first step toward smarter money management today with BudgetBuddy — your personal finance partner that fits right in your pocket.",


    "size": 22,
    "reviews": 1100,
    "ratingAvg": 4.7,
    "downloads": "1.78M",
    "mb": "675 MB",
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 715 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vCdny8Dc/a552c7db13f0e172abb3ba9b086b5434.jpg",
    "title": "Jump Ninja",
    "companyName": "ActionPlay",
    "id": 10,
    "description": "Jump Ninja is an action-packed platformer that challenges your reflexes and timing skills through fast-paced jumping gameplay. You play as a swift ninja navigating dangerous traps, walls, and enemies across beautifully designed levels. The goal is simple — jump, dodge, and survive as long as you can. But every level brings new obstacles that test your precision. With intuitive one-touch controls, Jump Ninja is easy to learn but hard to master. The minimalist art style, smooth animations, and dynamic background music make every session thrilling. You can unlock new ninja characters, each with unique outfits and special abilities. Daily missions and global leaderboards keep the competition alive. The game runs flawlessly on all devices and works perfectly offline. Players love its addictive gameplay loop — short, challenging runs that keep you coming back for one more try. The power-ups and achievements make progression even more rewarding. Jump Ninja is designed to be fun, fast, and endlessly replayable. Whether you’re on a short break or a long commute, this game delivers a quick dose of excitement and skill-based fun. Sharpen your reflexes, master the jumps, and become the ultimate ninja warrior. Do you have what it takes to conquer the shadows?" ,
    "size": 21,
    "reviews": 1800,
    "ratingAvg": 4.4,
    "downloads": "1.2M",
    "mb": "411 MB",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 850 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wNsXbZWT/3347846451147118e7e050b04789b3db.jpg",
    "title": "FitTrack",
    "companyName": "HealthTech",
    "id": 11,
    "description": "FitTrack is your all-in-one fitness and health tracker designed to help you stay active, motivated, and healthy. Whether you’re working out at the gym, running outdoors, or tracking your daily steps, FitTrack keeps you informed about your progress. The app allows you to monitor workouts, calories burned, heart rate, and even sleep patterns. You can create personalized workout plans, set fitness goals, and follow guided exercise routines. FitTrack’s intuitive dashboard displays your activity trends with detailed charts and insights to keep you on track. Sync with wearable devices for more accurate tracking and real-time data. The app also includes hydration reminders, meal tracking, and BMI analysis for a complete wellness experience. You can join community challenges, compete with friends, and earn rewards for consistency. FitTrack is lightweight, battery-efficient, and works seamlessly offline, allowing you to log workouts anytime. With motivational quotes, progress badges, and a clean interface, it makes fitness enjoyable and achievable. The app also ensures your data is private and secure with end-to-end encryption. Regular updates bring new workouts, tracking features, and health tips from professionals. FitTrack is more than just a fitness app — it’s your digital coach, motivator, and progress partner. Start your journey toward a healthier you today with FitTrack!",

    "size": 20,
    "reviews": 1250,
    "ratingAvg": 4.6,
    "downloads": "3.9M",
    "mb": "672 MB",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 645 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Y77m84pV/c26251832de134c7d330cb32baf0cca9.jpg",
    "title": "Candy Pop",
    "companyName": "SweetGames",
    "id": 12,
       "description": "Candy Pop is a colorful and addictive puzzle game where you match candies to clear levels and unlock new challenges. With hundreds of exciting stages and charming graphics, it offers hours of fun for players of all ages. The gameplay is simple — swap and match three or more candies of the same color to score points and trigger sweet combos. As you advance, new obstacles like chocolate blocks, ice cubes, and special candies keep things fresh and exciting. The game features boosters and power-ups that help you overcome tricky levels with ease. Vibrant animations, cheerful music, and smooth transitions create a delightful experience. Candy Pop works offline, so you can enjoy the sweetness anytime, anywhere. Daily rewards, special events, and leaderboard competitions keep players engaged. The game is optimized to run smoothly on all devices while using minimal battery. You can connect with friends, share your progress, and challenge them to beat your high score. Candy Pop isn’t just a casual game — it’s a mood booster that brings color and joy to your day. Easy to play but challenging to master, it’s perfect for quick fun or long play sessions. Dive into the sugary world of Candy Pop and start your delicious adventure now!",
    "size": 19,
    "reviews": 2000,
    "ratingAvg": 4.3,
    "downloads": "1.5M",
    "mb": "562 MB",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 970 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/p7H6WzV/6ec465a87cfd2bdac2e2d60d1fece6f9.jpg",
    "title": "QuickScan",
    "companyName": "ScanTech",
    "id": 13,
        "description": "QuickScan transforms your mobile device into a powerful pocket scanner. With just a few taps, you can scan documents, receipts, business cards, and even handwritten notes with high clarity. The app uses advanced image processing technology to automatically detect edges, correct perspective, and enhance text visibility. You can export your scans as PDF or image files and organize them into folders for easy access. QuickScan supports multi-page scanning, batch mode, and cloud sync, making it ideal for professionals and students alike. You can also sign, annotate, or share documents directly via email or social media. The app works offline, so you can scan anywhere, anytime without an internet connection. With a clean and minimal interface, it’s easy for anyone to use. The built-in OCR (Optical Character Recognition) feature converts printed text into editable digital text instantly. Security is a top priority — all scanned data is stored locally unless you choose to sync it. Lightweight and fast, QuickScan delivers crisp, high-quality scans in seconds. Whether you need to submit official documents or save lecture notes, QuickScan ensures you’re always organized. Experience the convenience of paperless efficiency — download QuickScan today and make scanning simpler than ever!",
    "size": 21,
    "reviews": 950,
    "ratingAvg": 4.5,
    "downloads": "1.75M",
     "mb": "212 MB",
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 565 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/BHcRmn5q/38a6980dc2c105deece96a675d70884b.jpg",
    "title": "Bubble Shooter",
    "companyName": "ClassicGames",
    "id": 14,
     "description": "Bubble Shooter brings back the timeless fun of bubble-popping arcade gameplay in a fresh and colorful design. The objective is simple yet addictive — aim, shoot, and match three or more bubbles of the same color to clear the board. As you progress through hundreds of levels, you’ll encounter unique challenges, tricky layouts, and fun power-ups. Each level offers different goals, from clearing all bubbles to rescuing trapped characters, keeping gameplay exciting. The smooth controls and physics-based mechanics make aiming precise and satisfying. With cheerful graphics, upbeat sound effects, and relaxing background music, Bubble Shooter is perfect for casual gaming. You can play offline anytime and enjoy stress-free fun wherever you are. Daily missions, achievements, and leaderboard rankings add competitive depth. The game is optimized for low storage usage and long play sessions without draining your battery. New events and special boosters are added regularly to keep the experience fresh. Whether you’re looking to relax or test your puzzle-solving skills, Bubble Shooter delivers hours of joyful entertainment. Simple to play but hard to master — it’s a classic reborn for the modern era. Get ready to pop, aim, and shoot your way to victory!",
    "size": 20,
    "reviews": 1600,
    "ratingAvg": 4.4,
    "downloads": "1.1M",
    "mb": "442 MB",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 750 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MyDkDrzg/df070ead2b73250d56c9b88ceb4b76c8.jpg",
    "title": "Language Learner",
    "companyName": "EduTech",
    "id": 15,
       "description": "Language Learner makes mastering new languages fun, interactive, and effective. With bite-sized lessons, engaging games, and real-life dialogues, you’ll start speaking confidently in no time. The app supports multiple languages including English, Spanish, French, German, Italian, and more. Each lesson focuses on practical communication, covering vocabulary, grammar, pronunciation, and listening comprehension. The built-in speech recognition helps you practice speaking naturally and improves your accent. Language Learner adapts to your skill level, offering personalized learning paths that match your goals. Interactive exercises, flashcards, and quizzes make every session enjoyable. You can track your daily streak, earn achievements, and monitor your progress visually. Offline learning mode lets you study anytime without internet. The clean and user-friendly interface makes navigation effortless for beginners and advanced learners alike. The app also includes cultural notes and real-world usage examples to help you understand context better. Daily reminders keep you motivated, while adaptive review sessions reinforce what you’ve learned. Whether you’re learning for travel, work, or self-improvement, Language Learner ensures steady progress. Lightweight, efficient, and beautifully designed, it’s the perfect companion for your language journey. Learn smarter, faster, and with confidence using Language Learner!",
    "size": 22,
    "reviews": 1350,
    "ratingAvg": 4.7,
    "downloads": "2.82M",
    "mb": "282 MB",
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 895 }
    ]
  }
]
